# BritishThermalUnitsPerSquareFootDegreeFahrenheit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..BritishThermalUnitsPerSquareFootDegreeFahrenheit Property
UnitTypeId Class See Also
---
British thermal units per square foot degree Fahrenheit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId BritishThermalUnitsPerSquareFootDegreeFahrenheit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BritishThermalUnitsPerSquareFootDegreeFahrenheit As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BritishThermalUnitsPerSquareFootDegreeFahrenheit {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace